cases/template/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     pimpleFoam;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         10;
deltaT          0.0005;

writeControl    adjustableRunTime;
writeInterval   0.01;
purgeWrite      0;
writeFormat     binary;
writePrecision  8;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;

adjustTimeStep  yes;
maxCo           0.5;
maxDeltaT       0.002;

functions
{
    fieldAverage1
    {
        type            fieldAverage;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        fields
        (
            p
            {
                mean        on;
                prime2Mean  off;
            }
            U
            {
                mean        on;
                prime2Mean  off;
            }
        );
    }

    surfaces
    {
        type            surfaces;
        libs            (sampling);
        writeControl    writeTime;
        surfaceFormat   vtk;
        fields          (p U);
        interpolationScheme cellPoint;
        surfaceFields   (p U);

        headSurface
        {
            type            patch;
            patches         (head);
        }
    }
}
