cases/template/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale   1;

vertices
(
    (-1.0 -0.75 -0.5)  // 0
    ( 2.0 -0.75 -0.5)  // 1
    ( 2.0  0.75 -0.5)  // 2
    (-1.0  0.75 -0.5)  // 3
    (-1.0 -0.75  1.5)  // 4
    ( 2.0 -0.75  1.5)  // 5
    ( 2.0  0.75  1.5)  // 6
    (-1.0  0.75  1.5)  // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (60 30 40) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    sides
    {
        type patch;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
        );
    }
    top
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    ground
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);
