cases/template/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (__U_INF__ 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (__U_INF__ 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    sides
    {
        type            slip;
    }
    top
    {
        type            slip;
    }
    ground
    {
        type            noSlip;
    }
    head
    {
        type            noSlip;
    }
}
