cases/template/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.01;
    }
    outlet
    {
        type            zeroGradient;
    }
    sides
    {
        type            slip;
    }
    top
    {
        type            slip;
    }
    ground
    {
        type            kqRWallFunction;
        value           uniform 0.01;
    }
    head
    {
        type            kqRWallFunction;
        value           uniform 0.01;
    }
}
