cases/template/0/omega
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 10;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 10;
    }
    outlet
    {
        type            zeroGradient;
    }
    sides
    {
        type            slip;
    }
    top
    {
        type            slip;
    }
    ground
    {
        type            omegaWallFunction;
        value           uniform 10;
    }
    head
    {
        type            omegaWallFunction;
        value           uniform 10;
    }
}
